{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "12.2 Часть 2"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Список четных\n",
    "\n",
    "На вход программе подается четное число n, n≥2. Напишите программу, которая выводит список четных чисел [2, 4, 6, ..., n].\n",
    "\n",
    "Формат входных данных: \n",
    "На вход программе подается четное натуральное число.\n",
    "\n",
    "Формат выходных данных: \n",
    "Программа должна вывести текст в соответствии с условием задачи."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[2, 4]\n"
     ]
    }
   ],
   "source": [
    "x=int(input())\n",
    "y=list(range(2,x+1,2))\n",
    "print(y)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Сумма двух списков\n",
    "\n",
    "На вход программе подаются две строки текста, содержащие целые числа. Из данных строк формируются списки чисел L и M. Напишите программу, которая создает третий список, элементами которого являются суммы соответствующих элементов списков L и M. Далее программа должна вывести каждый элемент полученного списка на одной строке через 1 пробел.\n",
    "\n",
    "Формат входных данных: \n",
    "На вход программе подаются две строки текста, содержащие целые числа, разделенные символом пробела.\n",
    "\n",
    "Формат выходных данных: \n",
    "Программа должна вывести текст в соответствии с условием задачи.\n",
    "\n",
    "Примечание. Количество чисел в обеих строках одинаковое."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "x=input().split()\n",
    "y=input().split()\n",
    "x=[int(i) for i in x]\n",
    "y=[int(j) for j in y]\n",
    "z=[x+y for x,y in zip(x,y)]\n",
    "print(*z, sep=' ')"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Сумма чисел\n",
    "\n",
    "На вход программе подается строка текста, содержащая натуральные числа. Напишите программу, которая вставляет между каждым числом знак +, а затем вычисляет сумму полученных чисел.\n",
    "\n",
    "Формат входных данных: \n",
    "На вход программе подается строка текста, содержащая натуральные числа, разделенные символом пробела.\n",
    "\n",
    "Формат выходных данных: \n",
    "Программа должна вывести текст в соответствии с условием задачи.\n",
    "\n",
    "Примечание. Строковый метод join() работает только со списком строк."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "x=input().split()\n",
    "y=[int(i) for i in x]\n",
    "z=sum(y)\n",
    "z1='+'.join(x)\n",
    "print(f'{z1}={z}')"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Валидный номер 🌶️🌶️\n",
    "\n",
    "На вход программе подается строка текста. Напишите программу, которая определяет является ли введенная строка корректным телефонным номером. Строка текста является корректным телефонным номером если она имеет формат: abc-def-hijk или 7-abc-def-hijk где a, b, c, d, e, f, h, i, j, k – цифры от 0 до 9.\n",
    "\n",
    "Формат входных данных: \n",
    "На вход программе подается строка текста.\n",
    "\n",
    "Формат выходных данных: \n",
    "Программа должна вывести «YES» если строка является корректным телефонным номером и «NO» в противном случае.\n",
    "\n",
    "Примечание. Телефонный номер должен содержать только цифры и символ -, а количество цифр в каждой группе должны быть правильным."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "x=input().split('-')\n",
    "count=0\n",
    "for i in x:\n",
    "    for j in i:\n",
    "        if (j.isalpha())==True:\n",
    "            count+=1\n",
    "if count!=0:\n",
    "    print('NO')\n",
    "else:\n",
    "    if len(x)==4 or len(x)==3:\n",
    "        if x[0]=='7' and len(x[0])==1:\n",
    "            print('YES')\n",
    "        else:\n",
    "            if len(x[0])==3 and len(x[1])==3 and len(x[2])==4:\n",
    "                print('YES')\n",
    "            else:\n",
    "                print('NO')\n",
    "    else:\n",
    "        print('NO')"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Самый длинный\n",
    "\n",
    "На вход программе подается строка текста. Напишите программу, использующую списочное выражение, которая находит длину самого длинного слова.\n",
    "\n",
    "Формат входных данных: \n",
    "На вход программе подается строка текста.\n",
    "\n",
    "Формат выходных данных: \n",
    "Программа должна вывести текст в соответствии с условием задачи."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "x=input().split()\n",
    "x=[len(i) for i in x]\n",
    "print(max(x))"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Молодежный жаргон\n",
    "\n",
    "На вход программе подается строка текста. Напишите программу, использующую списочное выражение, которая преобразует каждое слово введенного текста в \"молодежный жаргон\" по следующему правилу: \n",
    "\n",
    "первая буква каждого слова удаляется и ставится в конец слова;</br>\n",
    "затем в конец слова добавляется слог \"ки\".\n",
    "\n",
    "Формат входных данных: \n",
    "На вход программе подается строка текста на русском языке.\n",
    "\n",
    "Формат выходных данных: \n",
    "Программа должна вывести текст в соответствии с условием задачи."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "x=input().split()\n",
    "y=[]\n",
    "for i in range(len(x)):\n",
    "    z=x[i]\n",
    "    z=list(z)\n",
    "    k=z[0]\n",
    "    z.append(k)\n",
    "    del z[0]\n",
    "    z=z+['к', 'и']\n",
    "    z=''.join(z)\n",
    "    y.append(z)\n",
    "print(*y)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.2"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
