{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "8.2 Часть 2"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Ревью кода - 7 🌶️\n",
    "\n",
    "На обработку поступает натуральное число. Нужно написать программу, которая выводит на экран сумму чётных цифр этого числа или 0, если чётных цифр в записи нет. Программист торопился и написал программу неправильно.\n",
    "\n",
    "Найдите все ошибки в этой программе (их может быть одна или несколько). Известно, что каждая ошибка затрагивает только одну строку и может быть исправлена без изменения других строк.\n",
    "\n",
    "Примечание. Обратите внимание, что требуется найти ошибки в имеющейся программе, а не написать свою, возможно, использующую другой алгоритм решения."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "n = int(input())\n",
    "s = 0\n",
    "while n > 0:\n",
    "    if n % 2 == 0:\n",
    "            s += n % 10\n",
    "            n //= 10\n",
    "    else:\n",
    "        s+=0\n",
    "        n//=10\n",
    "print(s)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Ревью кода - 8 🌶️\n",
    "\n",
    "На обработку поступает последовательность из 8 целых чисел. Известно, что вводимые числа по абсолютной величине не превышают 10^12. Нужно написать программу, которая выводит на экран количество делящихся нацело на 4 чисел в исходной последовательности и максимальное делящееся нацело на 4 число. Если делящихся нацело на 4 чисел нет, требуется на экран вывести «NO». Программист торопился и написал программу неправильно.\n",
    "\n",
    "Найдите все ошибки в этой программе (их может быть одна или несколько). Известно, что каждая ошибка затрагивает только одну строку и может быть исправлена без изменения других строк.\n",
    "\n",
    "Примечание. Обратите внимание, что требуется найти ошибки в имеющейся программе, а не написать свою, возможно, использующую другой алгоритм решения."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "count = 0\n",
    "maximum = -10**6\n",
    "for i in range(8):\n",
    "    x = int(input())\n",
    "    if x % 4 == 0:\n",
    "        count += 1\n",
    "        if x > maximum:\n",
    "            maximum = x\n",
    "if count > 0:\n",
    "    print(count)\n",
    "    print(maximum)\n",
    "else:\n",
    "    print('NO')"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Ревью кода - 9\n",
    "\n",
    "На обработку поступает последовательность из 4 целых чисел. Известно, что вводимые числа по абсолютной величине не превышают 10^8. Нужно написать программу, которая выводит на экран количество нечётных чисел в исходной последовательности и максимальное нечётное число. Если нечётных чисел нет, требуется на экран вывести «NO». Программист торопился и написал программу неправильно.\n",
    "\n",
    "Найдите все ошибки в этой программе (их может быть одна или несколько). Известно, что каждая ошибка затрагивает только одну строку и может быть исправлена без изменения других строк.\n",
    "\n",
    "Примечание. Обратите внимание, что требуется найти ошибки в имеющейся программе, а не написать свою, возможно, использующую другой алгоритм решения."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "count = 0\n",
    "maximum = -10**6\n",
    "for i in range(4):\n",
    "    x = int(input())\n",
    "    if x % 2 != 0:\n",
    "        count += 1\n",
    "        if x > maximum:\n",
    "            maximum = x\n",
    "if count > 0:\n",
    "    print(count)\n",
    "    print(maximum)\n",
    "else:\n",
    "    print('NO')"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Звездная рамка\n",
    "\n",
    "На вход программе подается натуральное число n. Напишите программу, которая печатает звездную рамку размерами n×19.\n",
    "\n",
    "Формат входных данных: \n",
    "На вход программе подаётся натуральное число n∈[3; 19] — высота звездной рамки.\n",
    "\n",
    "Формат выходных данных: \n",
    "Программа должна вывести звездную рамку размерами n×19.\n",
    "\n",
    "Подсказка. Для печати звездной линии используйте умножение строки на число."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "x=int(input())\n",
    "for i in range (1,x+1):\n",
    "    if i==1 or i==x:\n",
    "        print('*'*19)\n",
    "    else:\n",
    "        print('*                 *')"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Третья цифра\n",
    "\n",
    "Дано натуральное число n(n>99). Напишите программу, которая определяет его третью (с начала) цифру.\n",
    "\n",
    "Формат входных данных: \n",
    "На вход программе подается одно натуральное число, состоящее как минимум из трех цифр.\n",
    "\n",
    "Формат выходных данных: \n",
    "Программа должна вывести его третью (с начала) цифру."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "x=int(input())\n",
    "num=0\n",
    "while x>99:\n",
    "    y=x%10\n",
    "    num=y\n",
    "    x//=10\n",
    "print(num)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Все вместе 2\n",
    "\n",
    "Дано натуральное число. Напишите программу, которая вычисляет:\n",
    "\n",
    "количество цифр 3 в нем;</br>\n",
    "сколько раз в нем встречается последняя цифра;</br>\n",
    "количество четных цифр;</br>\n",
    "сумму его цифр, больших пяти;</br>\n",
    "произведение цифр, больших семи (если цифр больших семи нет, то вывести 1, если такая цифра одна, то вывести ее);</br>\n",
    "сколько раз в нем встречается цифры 0 и 5 (всего суммарно).\n",
    "\n",
    "Формат входных данных: \n",
    "На вход программе подается одно натуральное число.\n",
    "\n",
    "Формат выходных данных: \n",
    "Программа должна вывести значения указанных величин в указанном порядке."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "x=int(input())\n",
    "num_3=0\n",
    "num_last=x%10\n",
    "num_last_count=0\n",
    "num_chet=0\n",
    "num_more_five=0\n",
    "num_more_seven=1\n",
    "zero_five=0\n",
    "while x>0:\n",
    "    y=x%10\n",
    "    if y==3:\n",
    "        num_3+=1\n",
    "    if y==num_last:\n",
    "        num_last_count+=1\n",
    "    if y%2==0:\n",
    "        num_chet+=1\n",
    "    if y>5:\n",
    "        num_more_five+=y\n",
    "    if y>7:\n",
    "        num_more_seven*=y\n",
    "    if y==0 or y==5:\n",
    "        zero_five+=1\n",
    "    x//=10\n",
    "print(num_3)\n",
    "print(num_last_count)\n",
    "print(num_chet)\n",
    "print(num_more_five)\n",
    "print(num_more_seven)\n",
    "print(zero_five)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.11.2"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "3930fa8174d0228d9e395ec6231f5c9aec035e2f3ca2c882a5c45971fd8e14a2"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
